"""
Вашей задачей будет создать сервер агрегатор (он выполнит несколько запросов на адреса сторонних сайтов).
Количество сайтов и сами сайты на которые вы будете слать реквесты вы определяете сами
(вот например по ссылке ниже найдете список популярных ресурсов, но, как правило, они требуют регистрации,
после чего они предоставят вам что-то типа ключа с которым вы сможете запросить информацию)

1) Познакомиться с фреймворком AIOHTTP (https://docs.aiohttp.org/en/stable/).
2) Создать сервер который мог бы принимать GET запросы на адрес (http://localhost/collect_info)
3) В ответе должна быть агрегирована информация полученная от сторонних ресурсов.
"""
